In [1]:
import pandas as pd

In [3]:
df = pd.read_csv("state-population.csv")

##  하나의 행으로 읽는  반복자 클래스를 만들기

In [6]:
df.iterrows()

In [12]:
df.head()

  state/region     ages  year  population
0           AL  under18  2012   1117489.0
1           AL    total  2012   4817528.0
2           AL  under18  2010   1130966.0
3           AL    total  2010   4785570.0
4           AL  under18  2011   1125763.0

In [7]:
count = 0 
for i in df.iterrows() :
    print(i) 
    count += 1
    if count == 5 :
        break

(0, state/region             AL
ages                under18
year                   2012
population      1.11749e+06
Name: 0, dtype: object)
(1, state/region             AL
ages                  total
year                   2012
population      4.81753e+06
Name: 1, dtype: object)
(2, state/region             AL
ages                under18
year                   2010
population      1.13097e+06
Name: 2, dtype: object)
(3, state/region             AL
ages                  total
year                   2010
population      4.78557e+06
Name: 3, dtype: object)
(4, state/region             AL
ages                under18
year                   2011
population      1.12576e+06
Name: 4, dtype: object)

## 칼럼단위로 검색하는 반복자 이해하기

In [14]:
df.iteritems()

In [13]:
count = 0 
for i in df.iteritems() :
    print(i) 
    count += 1
    if count == 2 :
        break

('state/region', 0        AL
1        AL
2        AL
3        AL
4        AL
5        AL
6        AL
7        AL
8        AL
9        AL
10       AL
11       AL
12       AL
13       AL
14       AL
15       AL
16       AL
17       AL
18       AL
19       AL
20       AL
21       AL
22       AL
23       AL
24       AL
25       AL
26       AL
27       AL
28       AL
29       AL
       ...
2514    USA
2515    USA
2516    USA
2517    USA
2518    USA
2519    USA
2520    USA
2521    USA
2522    USA
2523    USA
2524    USA
2525    USA
2526    USA
2527    USA
2528    USA
2529    USA
2530    USA
2531    USA
2532    USA
2533    USA
2534    USA
2535    USA
2536    USA
2537    USA
2538    USA
2539    USA
2540    USA
2541    USA
2542    USA
2543    USA
Name: state/region, Length: 2544, dtype: object)
('ages', 0       under18
1         total
2       under18
3         total
4       under18
5         total
6         total
7       under18
8       under18
9         total
10        total
11      under18
12        total
13      under18
14        total
15      under18
16        total
17      under18
18        total
19      under18
20        total
21      under18
22        total
23      under18
24        total
25      under18
26      under18
27        total
28        total
29      under18
         ...
2514    under18
2515      total
2516    under18
2517      total
2518      total
2519    under18
2520      total
2521    under18
2522      total
2523    under18
2524      total
2525    under18
2526      total
2527    under18
2528      total
2529    under18
2530      total
2531    under18
2532      total
2533    under18
2534    under18
2535      total
2536      total
2537    under18
2538    under18
2539      total
2540    under18
2541      total
2542    under18
2543      total
Name: ages, Length: 2544, dtype: object)

In [20]:
### 실제 반복자를 인덱싱으로 전체를 불러올 수 있다.

In [18]:
df['state/region'].head()

0    AL
1    AL
2    AL
3    AL
4    AL
Name: state/region, dtype: object

In [19]:
df['ages'].head()

0    under18
1      total
2    under18
3      total
4    under18
Name: ages, dtype: object

## 반복자를 이용해서 행으로 데이터를 가져오기

In [11]:
df.head()

  state/region     ages  year  population
0           AL  under18  2012   1117489.0
1           AL    total  2012   4817528.0
2           AL  under18  2010   1130966.0
3           AL    total  2010   4785570.0
4           AL  under18  2011   1125763.0

In [10]:
count = 0 
for i in df.itertuples() :
    print(i) 
    count += 1
    if count == 5 :
        break

Pandas(Index=0, _1='AL', ages='under18', year=2012, population=1117489.0)
Pandas(Index=1, _1='AL', ages='total', year=2012, population=4817528.0)
Pandas(Index=2, _1='AL', ages='under18', year=2010, population=1130966.0)
Pandas(Index=3, _1='AL', ages='total', year=2010, population=4785570.0)
Pandas(Index=4, _1='AL', ages='under18', year=2011, population=1125763.0)

### 행으로 슬라이싱을 해서 정보를 가져올 수 있다.

In [15]:
df.iloc[:5]

  state/region     ages  year  population
0           AL  under18  2012   1117489.0
1           AL    total  2012   4817528.0
2           AL  under18  2010   1130966.0
3           AL    total  2010   4785570.0
4           AL  under18  2011   1125763.0